; domain
;Header and description

(define (domain dominio)

;remove requirements that are not needed
(:requirements :strips :fluents :typing :negative-preconditions :disjunctive-preconditions)

(:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
box crane pallet dock conveyor height - object
)

(:predicates ;todo: define predicates here
(clear ?b - (either box pallet crane conveyor))  ;there's nothing above the box the pallet or box, oor the crane is empty
(on ?b1 - box ?b2 - (either pallet crane box conveyor)) ;box b1 is either above other box, a pallet or a crane
(at ?b - (either box crane pallet) ?d - dock )
(origin ?c - conveyor ?d - dock)
(destiny ?c - conveyor ?d - dock)
(isgreen ?b - (either pallet box))
(ready ?b - (either box pallet) ?d - dock)
(next ?h_prev - height ?h_next - height)
(box_height ?h - height ?b - (either box pallet))
(max_height ?h - height ?d - dock)
)

(:action unstack
    :parameters (?b1 - box ?b2 - (either pallet box) ?c - crane ?d - dock ?h - height)
    :precondition (and  (at ?b1 ?d) ;la caja está en un muelle
                        (at ?c ?d) ;la grúa esta en el mismo muelle
                        (clear ?b1) ;no hay nada sobre b1
                        (clear ?c) ;no hay nada en la grúa
                        (on ?b1 ?b2) ;b1 encima de una caja o pallet
                        (box_height ?h ?b1)
    )     
    :effect (and    (not (clear ?b1)) ;b1  deja de estar en una stack
                    (not (clear ?c)) ;la grúa  no está libre
                    (not (on ?b1 ?b2)) ;b1 deja de estar sobre b2
                    (not (ready ?b1 ?d)) ;la caja b1 deja de estar ready en el dock d
                    (not (box_height ?h ?b1))
                    (ready ?b2 ?d) ;la caja está ready
                    (on ?b1 ?c) ;b1 ahora está en la grúa
                    (clear ?b2) ;b2 ahora no tiene nada encima
                    )
)

(:action stack_wg_o_a
    :parameters (?b1 - box ?b2 - (either box pallet) ?c - crane ?d - dock ?hb2 - height ?hnext - height)
    :precondition (and  (on ?b1 ?c) ;caja sujeta por la grua
                        (clear ?b2) ;nada encima de b2 
                        (at ?c ?d) ;crane  en el mismo dock que b2
                        (at ?b2 ?d)
                        (or 
                        (isgreen ?b1)
                        (not (isgreen ?b2))
                        )
                        (box_height ?hb2 ?b2)
                        (next ?hb2 ?hnext)
                        (not (max_height ?hb2 ?d))

    )
    :effect (and    (not (on ?b1 ?c)) ;b1 no está en el crane ya
                    (not (clear ?b2)) ;b2 tiene cosas encima ahora
                    (on ?b1 ?b2) ;b1 encima de b2
                    (clear ?c) ;crane vacío
                    (clear ?b1) ;b1 no tiene nada encima
                    (ready ?b1 ?d)
                    (box_height ?hnext ?b1) ;b1 está ready (no borramos b2)
                    )
)


(:action stack_w_o_g
    :parameters (?b1 - box ?b2 - box ?c - crane ?d - dock ?hb2 - height ?hnext - height)
    :precondition (and  (on ?b1 ?c) ;caja sujeta por la grua
                        (clear ?b2) ;nada encima de b2 
                        (at ?c ?d) ;crane  en el mismo dock que b2
                        (at ?b2 ?d)
                        (not (isgreen ?b1)) ;la caja de abajo no es verde
                        (isgreen ?b2)
                        (box_height ?hb2 ?b2)
                        (next ?hb2 ?hnext)
                        (not (max_height ?hb2 ?d))
    )
    :effect (and    (not (on ?b1 ?c)) ;b1 no está en el crane ya
                    (not (clear ?b2)) ;b2 tiene cosas encima ahora
                    (not (ready ?b2 ?d)) ;b2 deja de estar ready
                    (on ?b1 ?b2) ;b1 encima de b2
                    (clear ?c) ;crane vacío
                    (clear ?b1) ;b1 no tiene nada encima
                    (ready ?b1 ?d)
                    (box_height ?hnext ?b1) ;b1 está ready (no borramos b2)
                    )
)

(:action load_conveyor
    :parameters (?b - box ?cr - crane ?c - conveyor ?d_og - dock ?d_dst - dock)
    :precondition (and  (on ?b ?cr) ;box is on a crane
                        (clear ?c) ;conveyor is clear
                        (origin ?c ?d_og) ;conveyor starts at d_og
                        (destiny ?c ?d_dst) ;conveyor ends at d_dst
                        (at ?cr ?d_og) ;crane is at dock origin
                        )
    :effect (and    (not (on ?b ?cr)) ;box not on crane
                    (clear ?cr) ;crane is clear
                    (not (clear ?c)) ;conveyor is not clear
                    (on ?b ?c) ;box is on conveyor 
                    (not (at ?b ?d_og))
                    (at ?b ?d_dst) ;box is now on dst dockc
    )
)

(:action unload_conveyor
    :parameters (?b - box ?c - conveyor ?cr - crane ?d - dock)
    :precondition (and  (on ?b ?c) ;caja en conveyor
                        (at ?b ?d) ;caja en el muelle
                        (at ?cr ?d) ;crane en el muelle
                        (clear ?cr) ;crane libre
    )
    :effect (and    (not (on ?b ?c))
                    (clear ?c)
                    (not (clear ?cr))
                    (on ?b ?cr)
    )
)
)

; problem
(define (problem problema_fuego) (:domain dominio)
(:objects
b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 - box
cr cr2 - crane
p1 p2 p3 p4 p5 p6 - pallet
d1 d2 - dock
c c2 - conveyor
h0 h1 h2 h3 h4 h5 h6 h7 h8 h9 - height
)

(:init
;donde estan las cajas
(at b1 d1)
(at b2 d1)
(at b3 d2)
(at b4 d2)
(at b5 d2)
(at b6 d2)
(at b7 d1)
(at b8 d2)
(at b9 d1)
(at b10 d1)
;alturas
(next h0 h1)
(next h1 h2)
(next h2 h3)
(next h3 h4)
(next h4 h5)
(next h5 h6)
(next h6 h7)
(next h7 h8)
(next h8 h9)
;max_height docks
(max_height h2 d1)
(max_height h2 d2)
;pallets
(box_height h0 p1)
(box_height h0 p2)
(box_height h0 p3)
(box_height h0 p4)
(box_height h0 p5)
(box_height h0 p6)
;cajas
(box_height h1 b1)
(box_height h1 b2)
(box_height h2 b3)
(box_height h1 b4)
(box_height h1 b5)
(box_height h1 b6)
(box_height h2 b7)
(box_height h2 b8)
(box_height h1 b9)
(box_height h2 b10)
;donde estan los pallets
(at p1 d1)
(at p2 d1)
(at p3 d1)
(at p4 d2)
(at p5 d2)
(at p6 d2)
;donde estan los crane
(at cr d1)
(at cr2 d2)
;que cajas estan clear
(clear b7)
(clear b10)
(clear b9)
(clear b8)
(clear b6)
(clear b3)
;crane clear
(clear cr)
(clear cr2)
;cintas clear
(clear c)
(clear c2)
;cómo apilo las cajas
(on b7 b1)
(on b1 p1)
(on b9 p2)
(on b10 b2)
(on b2 p3)
(on b8 b4)
(on b4 p4)
(on b3 b5)
(on b5 p5)
(on b6 p6)
;origin de las cintas
(origin c d1)
(destiny c d2)
(origin c2 d2)
(destiny c2 d1)
;ready de las cajas
(ready b7 d1)
(ready b9 d1)
(ready b10 d1)
(ready b8 d2)
(ready b3 d2)
(ready b6 d2)
;green boxes
(isgreen b7)
(isgreen b2)
(isgreen b3)
(isgreen b4)
(isgreen b6)
    ;todo: put the initial state's facts and numeric values here
)

(:goal (and
(ready b7 d1)
(ready b4 d1)
(ready b3 d1)
(ready b2 d1)
(ready b6 d1)
))

)

; plan
1. (unstack b3 b5 cr2 d2 h2)
   deleted: (clear b3) (clear cr2) (on b3 b5) (ready b3 d2) (box_height h2 b3)
   added: (ready b5 d2) (on b3 cr2) (clear b5)
   goals met: 1 of 5
2. (unstack b9 p2 cr d1 h1)
   deleted: (clear b9) (clear cr) (on b9 p2) (ready b9 d1) (box_height h1 b9)
   added: (ready p2 d1) (on b9 cr) (clear p2)
   goals met: 1 of 5
3. (load_conveyor b3 cr2 c2 d2 d1)
   deleted: (on b3 cr2) (clear c2) (at b3 d2)
   added: (clear cr2) (on b3 c2) (at b3 d1)
   goals met: 1 of 5
4. (load_conveyor b9 cr c d1 d2)
   deleted: (on b9 cr) (clear c) (at b9 d1)
   added: (clear cr) (on b9 c) (at b9 d2)
   goals met: 1 of 5
5. (unload_conveyor b3 c2 cr d1)
   deleted: (on b3 c2) (clear cr)
   added: (clear c2) (on b3 cr)
   goals met: 1 of 5
6. (unstack b6 p6 cr2 d2 h1)
   deleted: (clear b6) (clear cr2) (on b6 p6) (ready b6 d2) (box_height h1 b6)
   added: (ready p6 d2) (on b6 cr2) (clear p6)
   goals met: 1 of 5
7. (load_conveyor b6 cr2 c2 d2 d1)
   deleted: (on b6 cr2) (clear c2) (at b6 d2)
   added: (clear cr2) (on b6 c2) (at b6 d1)
   goals met: 1 of 5
8. (stack_wg_o_a b3 p2 cr d1 h0 h1)
   deleted: (on b3 cr) (clear p2)
   added: (on b3 p2) (clear cr) (clear b3) (ready b3 d1) (box_height h1 b3)
   goals met: 2 of 5
9. (unload_conveyor b6 c2 cr d1)
   deleted: (on b6 c2) (clear cr)
   added: (clear c2) (on b6 cr)
   goals met: 2 of 5
10. (unstack b8 b4 cr2 d2 h2)
   deleted: (clear b8) (clear cr2) (on b8 b4) (ready b8 d2) (box_height h2 b8)
   added: (ready b4 d2) (on b8 cr2) (clear b4)
   goals met: 2 of 5
11. (stack_wg_o_a b6 b3 cr d1 h1 h2)
   deleted: (on b6 cr) (clear b3)
   added: (on b6 b3) (clear cr) (clear b6) (ready b6 d1) (box_height h2 b6)
   goals met: 3 of 5
12. (stack_wg_o_a b8 p6 cr2 d2 h0 h1)
   deleted: (on b8 cr2) (clear p6)
   added: (on b8 p6) (clear cr2) (clear b8) (ready b8 d2) (box_height h1 b8)
   goals met: 3 of 5
13. (unstack b4 p4 cr2 d2 h1)
   deleted: (clear b4) (clear cr2) (on b4 p4) (ready b4 d2) (box_height h1 b4)
   added: (ready p4 d2) (on b4 cr2) (clear p4)
   goals met: 3 of 5
14. (unstack b10 b2 cr d1 h2)
   deleted: (clear b10) (clear cr) (on b10 b2) (ready b10 d1) (box_height h2 b10)
   added: (ready b2 d1) (on b10 cr) (clear b2)
   goals met: 4 of 5
15. (load_conveyor b4 cr2 c2 d2 d1)
   deleted: (on b4 cr2) (clear c2) (at b4 d2)
   added: (clear cr2) (on b4 c2) (at b4 d1)
   goals met: 4 of 5
16. (unload_conveyor b9 c cr2 d2)
   deleted: (on b9 c) (clear cr2)
   added: (clear c) (on b9 cr2)
   goals met: 4 of 5
17. (load_conveyor b10 cr c d1 d2)
   deleted: (on b10 cr) (clear c) (at b10 d1)
   added: (clear cr) (on b10 c) (at b10 d2)
   goals met: 4 of 5
18. (unload_conveyor b4 c2 cr d1)
   deleted: (on b4 c2) (clear cr)
   added: (clear c2) (on b4 cr)
   goals met: 4 of 5
19. (stack_wg_o_a b4 b2 cr d1 h1 h2)
   deleted: (on b4 cr) (clear b2)
   added: (on b4 b2) (clear cr) (clear b4) (ready b4 d1) (box_height h2 b4)
   goals met: 5 of 5
